slovar = {"один": 1, "два": 2, "три": 3, "четыре": 4, "пять": 5,
          "шесть": 6, "семь": 7, "восемь": 8, "девять": 9, "десять": 10,
          "одинадцать": 11, "двенадцать": 12, "тринадцать": 13, "четырнадцать": 14, "пятнадцать": 15,
          "шестнадцать": 16, "семьнадцать": 17, "восемьнадцать": 18, "девятнадцать": 19, "двадцать": 20,
          "двадцать один": 21, "двадцать два": 22, "двадцать три": 23, "двадцать четыре": 24, "двадцать пять": 25,
          "двадцать шесть": 26, "двадцать семь": 27, "двадцать восемь": 28, "двадцать девять": 29, "тридцать": 30,
          "тридцать один": 31, "тридцать два": 32, "тридцать три": 33, "тридцать четыре": 34, "тридцать пять": 35,
          "тридцать шесть": 36, "тридцать семь": 37, "тридцать восемь": 38, "тридцать девять": 39, "сорок": 40,
          "сорок один": 41, "сорок два": 42, "сорок три": 43, "сорок четыре": 44, "сорок пять": 45,
          "сорок шесть": 46, "сорок семь": 47, "сорок восемь": 48, "сорок девять": 49, "пятьдесят": 50,
          "пятьдесят один": 51, "пятьдесят два": 52, "пятьдесят три": 53, "пятьдесят четыре": 54, "пятьдесят пять": 55,
          "пятьдесят шесть": 56, "пятьдесят семь": 57, "пятьдесят восемь": 58, "пятьдесят девять": 59}

twelve_hours_digit = {"один": 1, "два": 2, "три": 3, "четыре": 4, "пять": 5,
                      "шесть": 6, "семь": 7, "восемь": 8, "девять": 9, "десять": 10,
                      "одинадцать": 11, "двенадцать": 12}

twelve_hours2_digit = {"час": 13, "два": 14, "три": 15, "четыре": 16, "пять": 17,
                       "шесть": 18, "семь": 19, "восемь": 20, "девять": 21, "десять": 22,
                       "одинадцать": 23, "двенадцать": 00}

text2num = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
            7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одинадцать", 12: "двенадцать"}


twelve_hours_nomn = {"первого": "один", "второго": "два", "третьего": "три",
                     "четвертого": "четыре", "пятого": "пять", "шестого": "шесть",
                     "седьмого": "семь", "восьмого": "восемь", "девятого": "девять",
                     "десятого": "десять", "одинадцатого": "одинадцать", "двенадцатого": "двенадцать"}

text2num_nomn = {1: "первого", 2: "второго", 3: "третьего",
                 4: "четвертого", 5: "пятого", 6: "шестого",
                 7: "седьмого", 8: "восьмого", 9: "девятого",
                 10: "десятого", 11: "одинадцатого", 12: "двенадцатого"}

text2num_nomn_vechera = {"первого": 13, "второго": 14, "третьего": 15,
                         "четвертого": 16, "пятого": 17, "шестого": 18,
                         "седьмого": 19, "восьмого": 20, "девятого": 21,
                         "десятого": 22, "одинадцатого": 23, "двенадцатого": 24}

# часов
h_very_short = ["1","2","3","4", "23", "24"] # часа
h_short = ["5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20", "21", "22",] # часов

def includer(text):
    text = text.split(":")
    if text[0] in h_very_short:
        text[0] += " часа "
    else:
        text[0] += " часов "

    text = "".join(i for i in text) + " минут"
    return text
